Can't change dimension segment to this value.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ChangeDimensionSegmentFailed { get; }
  Visual Basic
Public Shared ReadOnly Property ChangeDimensionSegmentFailed As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ChangeDimensionSegmentFailed {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DimensionFailures Class
  Autodesk.Revit.DB Namespace